---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSettings.SetDownFromBottom
source: html/a58f3175-0d33-e7ae-fe40-e332b19ea490.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.SetDownFromBottom Property

The abbreviation of the Set Down from bottom (BD) of fitting string.

## Syntax (C#)
```csharp
public string SetDownFromBottom { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null